# TODO начальный текст с приветствием
StartText = f'Я бот-помощник\U0001F916\n' \
            f'Вот что я могу:\n' \
            f'   1) Перейти на официальный сайт Gimbarr Official\U0001F680\n' \
            f'   2) Рассказать об основной информации по дисциплине\U0001F4DA\n' \
            f'   3) Показать как выглядит элемент лишь по названию\U0001F632\U0001F51D\n' \
            f'   4) Предоставить дополнительную информацию\U0000FE19\n' \
            f'   Также, вы можете поддержать проект\U0001F60E\U0001F4B0'

# TODO текст описания возможностей подписки
sub_text = f'Подписка позволит вам\n' \
           f'пользоваться дополнительными функциями бота:\n' \
           f'\U0001F539Показать элемент по названию\U0001F680\n' \
           f'\U0001F539Прикрепить ссылки на полезные источники\U0001F4DA' \
 \
    # TODO текст напоминания покупки подписки
sub_text_memory = f'\n\U00002757Не забывайте вовремя продлевать подписку, ' \
                  f'чтобы пользоваться полным функционалом бота\U0001F609'

# TODO текст благодарности за помощь каналу
support_channel_text = f'\U0001F607 Спасибо за помощь команде, это мотивирует нас на работу!\n' \
                       f'Ваша сумма пойдёт на оплату аренды сервера, чтобы бот работал на постоянной основе'

# TODO текст для новичков
green_text = f'\U0001F4AA Тренировка - это сложный и многогранный процесс\n \U0001F914 Новичку может быть непонятно '\
             f'с чего начать, какие трюки попробывать, как раскрыть свой потенциал и многое другое\n\U00002757' \
             f'Специально для тебя мы подготовили следующие материалы: ' \

# TODO текст о истории
history_text = f'\U0001F4DC Джимбарр зародился в Колумбии, Богота (около 1960-го годо).\n\U0001F4DC  Корни Джимбарра '\
               f'простираются ещё с 1644 года. Прародителем Джимбарра считается Аэриал страпс, так как именно в ' \
               f'нём наблюдается большое сходство с Джимбарром.\n\U0001F4DC Элементы в Аэриал страпсе выполняются ' \
               f'не на турниках, а на воздушных ремнях и кольцах'

# TODO текст о истории
zero_pars = f'К сожалению, в моей базе данных нет такого элемента.' \
            f'Возможно его не существует или было введено некорректное название элемента.' \
            f'Загрузи на YouTube видео с этим элементом и именно тебя я покажу в следующий раз\U0001F609'

# TODO текст поиска музыки
music_pars_text = f"\U0001F3B5Здесь вы можете легко распознать трек\U0001F3B5\n Просто перейдите по ссылке, запишите "\
                  f"короткое голосовое сообщение(5-10 секунд) и получите название трека, а также ссылку на " \
                  f"него. "

# TODO текст о плэйлисте с музыкой из отчётов
music_playlist_text = f'\U0001F3A7Это плэйлист, в котором вы найдёте музыку с отчётов, а также сезонных сборников.\n'\
                      f'(Мы рекомендуем вам открывать данный плэйлист в приложении Яндекс музыка)'
